# DW_pandas_Task3

## 20201220

DataWhale_pandas组队学习第三章，索引，继续努力！

### 索引器

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('../data/learn_pandas.csv', usecols = ['School', 'Grade', 'Name', 'Gender', 'Weight', 'Transfer'])
df['Name'].head()

0      Gaopeng Yang
1    Changqiang You
2           Mei Sun
3      Xiaojuan Sun
4       Gaojuan You
Name: Name, dtype: object

In [3]:
df[['School', 'Name']].head()

                          School            Name
0  Shanghai Jiao Tong University    Gaopeng Yang
1              Peking University  Changqiang You
2  Shanghai Jiao Tong University         Mei Sun
3               Fudan University    Xiaojuan Sun
4               Fudan University     Gaojuan You

In [4]:
df.Grade.head()

0     Freshman
1     Freshman
2       Senior
3    Sophomore
4    Sophomore
Name: Grade, dtype: object

列索引取出单列可用两种方式，列名需无空格，返回值为Series，多列需以df[]加列表取出，格式为df[['','']]，返回值为DataFrame格式

In [5]:
s = pd.Series([1,2,3,4,5,6], index=['a','b','a','a','a','c'])
s[['c', 'b']]

c    6
b    2
dtype: int64

In [6]:
s['c': 'b': -2]

c    6
a    4
b    2
dtype: int64

In [7]:
s[-1:1:-2]

c    6
a    4
dtype: int64

注意取出多个索引和取出切片的用法，在()、[[]]、[]几个用法中经常搞混，要特别注意概念的理解,两种切片的用法取值不一样，按索引的切片包含两个端点，按索引位置的切片不包含右端点。

In [8]:
df_demo = df.set_index('Name')
df_demo.head()

,School,Grade,Gender,Weight,Transfer
Name,,,,,
Gaopeng Yang,Shanghai Jiao Tong University,Freshman,Female,46.0,N
Changqiang You,Peking University,Freshman,Male,70.0,N
Mei Sun,Shanghai Jiao Tong University,Senior,Male,89.0,N
Xiaojuan Sun,Fudan University,Sophomore,Female,41.0,N
Gaojuan You,Fudan University,Sophomore,Male,74.0,N

In [9]:
df_demo.loc['Mei Sun']

                                School   Grade  Gender  Weight Transfer
Name
Mei Sun  Shanghai Jiao Tong University  Senior    Male    89.0        N
Mei Sun  Shanghai Jiao Tong University  Junior  Female    50.0        N

In [10]:
df_demo.loc['Quan Zhao']

School      Shanghai Jiao Tong University
Grade                              Junior
Gender                             Female
Weight                                 53
Transfer                                N
Name: Quan Zhao, dtype: object

In [11]:
loclist = ['Gaopeng Yang', 'Xiaojuan Sun', 'Gaojuan You']
df_demo.loc[loclist, ['Gender', 'Weight']]

              Gender  Weight
Name
Gaopeng Yang  Female    46.0
Xiaojuan Sun  Female    41.0
Xiaojuan Sun  Female    46.0
Gaojuan You     Male    74.0

In [12]:
df_demo_1 = df_demo.copy()
df_demo_1.index = range(200)
df_demo_1.shape

(200, 5)

In [13]:
df_demo_1.loc[195:200]

                            School      Grade  Gender  Weight Transfer
195               Fudan University     Junior  Female    46.0        N
196            Tsinghua University     Senior  Female    50.0        N
197  Shanghai Jiao Tong University     Senior  Female    45.0        N
198  Shanghai Jiao Tong University     Senior    Male    71.0        N
199            Tsinghua University  Sophomore    Male    51.0        N

In [14]:
df_demo_1.loc[195:-1]

Empty DataFrame
Columns: [School, Grade, Gender, Weight, Transfer]
Index: []

这上面有点搞不懂了，为什么-1会没数据，切片应该没什么问题啊？哎，Name这个索引也没有了，是替换掉了吧，怎么把索引恢复为数据？

In [15]:
df_demo_2 = df_demo.copy()
df_demo_2['Name'] = df_demo_2.index
df_demo_2.index = range(df_demo_2.shape[0],0,-1)
df_demo_2[::-1].head()

,School,Grade,Gender,Weight,Transfer,Name
1,Tsinghua University,Sophomore,Male,51.0,N,Chunpeng Lv
2,Shanghai Jiao Tong University,Senior,Male,71.0,N,Chengmei Shen
3,Shanghai Jiao Tong University,Senior,Female,45.0,N,Chengqiang Chu
4,Tsinghua University,Senior,Female,50.0,N,Li Zhao
5,Fudan University,Junior,Female,46.0,N,Xiaojuan Sun

索引值的转换解决了，但切片的问题还没搞清楚，先看下去再说

In [16]:
df_demo.loc[df_demo.Weight <70].head()

,School,Grade,Gender,Weight,Transfer
Name,,,,,
Gaopeng Yang,Shanghai Jiao Tong University,Freshman,Female,46.0,N
Xiaojuan Sun,Fudan University,Sophomore,Female,41.0,N
Xiaoli Qian,Tsinghua University,Freshman,Female,51.0,N
Qiang Chu,Shanghai Jiao Tong University,Freshman,Female,52.0,N
Gaoqiang Qian,Tsinghua University,Junior,Female,50.0,N

In [17]:
df_demo.loc[df_demo.School.isin(['Peking University'])].head()

                           School      Grade  Gender  Weight Transfer
Name
Changqiang You  Peking University   Freshman    Male    70.0        N
Juan Xu         Peking University     Junior  Female     NaN        N
Changjuan You   Peking University     Junior  Female    47.0        N
Changmei Xu     Peking University  Sophomore  Female    43.0        N
Changli Lv      Peking University     Senior  Female    41.0        N

In [18]:
cond1 = df_demo.School == 'Fudan University'
cond2 = df_demo.Gender == 'Male'
cond3 = df_demo.Grade == 'Junior'
condx = cond1&(~cond2)&cond3
df_demo.loc[condx]

                          School   Grade  Gender  Weight Transfer
Name
Yanli You       Fudan University  Junior  Female    48.0        N
Yanjuan Lv      Fudan University  Junior  Female    49.0      NaN
Gaoqiang Zhou   Fudan University  Junior  Female    43.0        N
Xiaojuan Zhao   Fudan University  Junior  Female    49.0        N
Gaoquan Chu     Fudan University  Junior  Female    51.0        N
Gaojuan Qian    Fudan University  Junior  Female    44.0        N
Xiaojuan Qian   Fudan University  Junior  Female    51.0        N
Chunjuan Zhang  Fudan University  Junior  Female    47.0        N
Xiaojuan Sun    Fudan University  Junior  Female    46.0        N

复合条件想用一句写完没成功，总是提示错误，是必须要赋值变量才可以吗，不能直接在df_demo.loc[]中将复合条件写入？

#### 【练一练】

`select_dtypes`是一个实用函数，它能够从表中选出相应类型的列，若要选出所有数值型的列，只需使用`.select_dtypes('number')`，请利用布尔列表选择的方法结合`DataFrame`的`dtypes`属性在`learn_pandas`数据集上实现这个功能。

In [19]:
df.select_dtypes('number')

     Weight
0      46.0
1      70.0
2      89.0
3      41.0
4      74.0
..      ...
195    46.0
196    50.0
197    45.0
198    71.0
199    51.0

[200 rows x 1 columns]

In [20]:
cond1 = df.dtypes == float
cond2 = df.dtypes == int
condx = cond1|cond2
condx

School      False
Grade       False
Name        False
Gender      False
Weight       True
Transfer    False
dtype: bool

In [21]:
df.loc[:,condx]

     Weight
0      46.0
1      70.0
2      89.0
3      41.0
4      74.0
..      ...
195    46.0
196    50.0
197    45.0
198    71.0
199    51.0

[200 rows x 1 columns]

做练一练折腾了很久，前面的布尔列表倒没什么问题，后面一直理解使用成df.loc[[:],condx]，然后绕了很久，基础用法还是太弱了。

In [22]:
df.iloc[4:9,0:3]

                          School      Grade           Name
4               Fudan University  Sophomore    Gaojuan You
5            Tsinghua University   Freshman    Xiaoli Qian
6  Shanghai Jiao Tong University   Freshman      Qiang Chu
7            Tsinghua University     Junior  Gaoqiang Qian
8            Tsinghua University   Freshman  Changli Zhang

In [23]:
df.iloc[lambda x:slice(1,5)]

,School,Grade,Name,Gender,Weight,Transfer
1,Peking University,Freshman,Changqiang You,Male,70.0,N
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,89.0,N
3,Fudan University,Sophomore,Xiaojuan Sun,Female,41.0,N
4,Fudan University,Sophomore,Gaojuan You,Male,74.0,N

In [24]:
df.iloc[1:5]

,School,Grade,Name,Gender,Weight,Transfer
1,Peking University,Freshman,Changqiang You,Male,70.0,N
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,89.0,N
3,Fudan University,Sophomore,Xiaojuan Sun,Female,41.0,N
4,Fudan University,Sophomore,Gaojuan You,Male,74.0,N

这两个切片没什么区别啊，函数表达应该是在某些时候需要应用

In [25]:
df.iloc[(df.Weight>80).values].head()

,School,Grade,Name,Gender,Weight,Transfer
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,89.0,N
23,Shanghai Jiao Tong University,Senior,Qiang Zheng,Male,87.0,N
38,Peking University,Freshman,Qiang Han,Male,87.0,N
66,Fudan University,Senior,Chengpeng Zhou,Male,81.0,N
71,Shanghai Jiao Tong University,Sophomore,Feng Han,Male,82.0,N

In [26]:
df.School.iloc[0]

'Shanghai Jiao Tong University'

In [27]:
df.School.iloc[4:9:2]

4                 Fudan University
6    Shanghai Jiao Tong University
8              Tsinghua University
Name: School, dtype: object

各命令返回的值不相同，有Series和DataFrame，在实际操作中容易搞混了，如何熟练应用，对数据进行分析处理？

In [28]:
df.query('(Gender == "Male")&(Weight > Weight.mean())').head()

,School,Grade,Name,Gender,Weight,Transfer
1,Peking University,Freshman,Changqiang You,Male,70.0,N
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,89.0,N
4,Fudan University,Sophomore,Gaojuan You,Male,74.0,N
10,Shanghai Jiao Tong University,Freshman,Xiaopeng Zhou,Male,74.0,N
16,Tsinghua University,Junior,Xiaoqiang Qin,Male,68.0,N

In [29]:
lowx, highx = 50, 80
df.query('(Weight.between(@lowx, @highx).values) and (Grade not in ["Junior"])').head()

,School,Grade,Name,Gender,Weight,Transfer
1,Peking University,Freshman,Changqiang You,Male,70.0,N
4,Fudan University,Sophomore,Gaojuan You,Male,74.0,N
5,Tsinghua University,Freshman,Xiaoli Qian,Female,51.0,N
6,Shanghai Jiao Tong University,Freshman,Qiang Chu,Female,52.0,N
10,Shanghai Jiao Tong University,Freshman,Xiaopeng Zhou,Male,74.0,N

In [30]:
df.query('(Weight.between(@lowx, @highx).values) and (Grade in ["Junior"])', engine='python').head()

,School,Grade,Name,Gender,Weight,Transfer
7,Tsinghua University,Junior,Gaoqiang Qian,Female,50.0,N
16,Tsinghua University,Junior,Xiaoqiang Qin,Male,68.0,N
17,Tsinghua University,Junior,Peng Wang,Male,65.0,N
27,Tsinghua University,Junior,Qiang Sun,Female,53.0,N
31,Shanghai Jiao Tong University,Junior,Feng Zheng,Female,51.0,N

query用起来好象挺方便的，可以随意组合，只是用了not in 可以，用is in 却不行，查询百度是说关键字无效，是这个版本不支持吗？

群里大家对各种方式都测试了，是不能用is in ，换成in 就可以了，还可以添加engine='python'进行解释

In [31]:
df.sample(5, axis=0, replace=True)

,School,Grade,Name,Gender,Weight,Transfer
151,Tsinghua University,Sophomore,Feng Qian,Female,43.0,N
146,Tsinghua University,Freshman,Juan Zhang,Female,55.0,N
101,Peking University,Sophomore,Xiaoli Zhou,Female,55.0,N
116,Peking University,Senior,Feng Zhao,Male,66.0,N
50,Shanghai Jiao Tong University,Junior,Xiaoli Wang,Male,70.0,N

随机抽样的具体用法查了一下，DataFrame.sample(n=None, frac=None, replace=False, weights=None, random_state=None, axis=None)

weitghts：指定权重信息，需要与行或者列的数目相等，为列表。

### 多级索引

In [32]:
df_multi = df.set_index(['School', 'Grade'])
df_multi.head()

                                                   Name  Gender  Weight  \
School                        Grade
Shanghai Jiao Tong University Freshman     Gaopeng Yang  Female    46.0
Peking University             Freshman   Changqiang You    Male    70.0
Shanghai Jiao Tong University Senior            Mei Sun    Male    89.0
Fudan University              Sophomore    Xiaojuan Sun  Female    41.0
                              Sophomore     Gaojuan You    Male    74.0

                                        Transfer
School                        Grade
Shanghai Jiao Tong University Freshman         N
Peking University             Freshman         N
Shanghai Jiao Tong University Senior           N
Fudan University              Sophomore        N
                              Sophomore        N

In [33]:
df_multi = df_multi.sort_index()
df_multi.loc[('Peking University', 'Freshman')].head()

                                      Name  Gender  Weight Transfer
School            Grade
Peking University Freshman  Changqiang You    Male    70.0        N
                  Freshman     Gaopeng Shi  Female    48.0        N
                  Freshman      Gaoli Zhao    Male    78.0        N
                  Freshman    Xiaojuan Qin    Male    79.0        Y
                  Freshman       Qiang Han    Male    87.0        N

#### 【练一练】

与单层索引类似，若存在重复元素，则不能使用切片，请去除重复索引后给出一个元素切片的例子。

In [34]:
df_multi.loc['Fudan University':'Peking University'].tail(10)

                                      Name  Gender  Weight Transfer
School            Grade
Peking University Senior     Changquan Han    Male    77.0        N
                  Senior          Mei Feng  Female    51.0        N
                  Senior     Chunpeng Qian  Female     NaN        N
                  Senior          Juan You    Male    69.0      NaN
                  Senior       Yanmei Qian  Female    49.0      NaN
                  Sophomore    Changmei Xu  Female    43.0        N
                  Sophomore   Xiaopeng Qin    Male     NaN        N
                  Sophomore         Mei Xu  Female    39.0        N
                  Sophomore    Xiaoli Zhou  Female    55.0        N
                  Sophomore       Peng Han  Female    34.0      NaN

In [35]:
df_multi.loc['Senior':'Freshman'].head()

Empty DataFrame
Columns: [Name, Gender, Weight, Transfer]
Index: []

有点搞不清楚这道题的意思，是太笨了点吧！

In [36]:
res = df_multi.loc[(['Peking University', 'Fudan University'], ['Sophomore', 'Junior']), :]
res.sample(5)

                                      Name  Gender  Weight Transfer
School            Grade
Fudan University  Sophomore         Mei Xu    Male    79.0        N
Peking University Junior     Changjuan You  Female    47.0        N
Fudan University  Junior      Changfeng Lv    Male    76.0        N
                  Sophomore  Chengqiang Lv  Female    53.0        N
                  Junior      Gaojuan Qian  Female    44.0        N

In [37]:
res = df_multi.loc[[('Peking University', 'Junior'), ('Fudan University', 'Sophomore')]]
res.sample(5)

                                        Name  Gender  Weight Transfer
School            Grade
Fudan University  Sophomore    Chengqiang Lv  Female    53.0        N
Peking University Junior       Xiaofeng Zhao  Female    46.0        N
Fudan University  Sophomore  Changqiang Qian    Male    64.0        N
Peking University Junior             Juan Xu  Female     NaN        N
                  Junior        Chengli Zhao    Male     NaN      NaN

对多层的元素进行交叉组合后索引，但同时需要指定loc的列，全选则用:表示，这两种方法值不同，用法灵活，其一为选出所有北大和复旦的大二大三学生，其二为选出北大的大三学生和复旦的大二学生，采用的是元组和列表的不同组合。

In [38]:
idx = pd.IndexSlice
df_multi.loc[idx[:'Peking University'], idx['Weight':]]

                             Weight Transfer
School            Grade
Fudan University  Freshman     49.0        N
                  Freshman     63.0        N
                  Freshman     43.0        N
                  Freshman     55.0        N
                  Freshman     74.0        N
...                             ...      ...
Peking University Sophomore    43.0        N
                  Sophomore     NaN        N
                  Sophomore    39.0        N
                  Sophomore    55.0        N
                  Sophomore    34.0      NaN

[74 rows x 2 columns]

大致弄清楚了IndexSlice对象的使用，按层切片索引，在同一层有重复的索引应该也不能切片吧

In [40]:
my_list1 = ['a','b']
my_list2 = ['cat','dog']
pd.MultiIndex.from_product([my_list1, my_list2], names=['First','Second'])

MultiIndex([('a', 'cat'),
            ('a', 'dog'),
            ('b', 'cat'),
            ('b', 'dog')],
           names=['First', 'Second'])

学了下笛卡尔积，是指在数学中，两个集合X和Y的笛卡尓积（Cartesian product），又称直积，表示为X×Y，第一个对象是X的成员而第二个对象是Y的所有可能有序对的其中一个成员。假设集合A={a, b}，集合B={0, 1, 2}，则两个集合的笛卡尔积为{(a, 0), (a, 1), (a, 2), (b, 0), (b, 1), (b, 2)}。这意思比较简捷明了。

### 索引的常用方法

df_ex.swaplevel(0,2,axis=1).head() # 列索引的第一层和第三层交换

这个0，2指的是某层之间的交换。

df_ex.reorder_levels([2,0,1],axis=0).head() # 列表数字指代原来索引中的层

这列表中的2，0，1指的是原索引的顺序按目前的格式来排列。

df_ex.droplevel(1,axis=1)

删除层直接输入层位置号即可 1 ，或者是列表[0,1]，表示删除第一二层。

索引属性修改：

df_ex.rename_axis(index={'Upper':'Changed_row'}, columns={'Other':'Changed_Col'}).head()

通过rename_axis可以对索引层的名字进行修改，常用的修改方式是传入字典的映射。

df_ex.rename(columns={'cat':'not_cat'}, level=2).head()

通过rename可以对索引的值进行修改，如果是多级索引需要指定修改的层号level。

df_ex.rename(index=lambda x:str.upper(x), level=2).head()

传入参数也可以是函数，其输入值就是索引元素。

#### 【练一练】
尝试在`rename_axis`中使用函数完成与例子中一样的功能。

In [41]:
res.head()

                                   Name  Gender  Weight Transfer
School            Grade
Peking University Junior        Juan Xu  Female     NaN        N
                  Junior  Changjuan You  Female    47.0        N
                  Junior       Gaoli Xu  Female    48.0        N
                  Junior   Gaoquan Zhou    Male    70.0        N
                  Junior      Qiang You  Female    56.0        N

In [54]:
res.columns.name = 'all'
res.head()

all                                Name  Gender  Weight Transfer
School            Grade
Peking University Junior        Juan Xu  Female     NaN        N
                  Junior  Changjuan You  Female    47.0        N
                  Junior       Gaoli Xu  Female    48.0        N
                  Junior   Gaoquan Zhou    Male    70.0        N
                  Junior      Qiang You  Female    56.0        N

In [55]:
res.rename_axis(index={'School':'Changed_now'}, columns={'all':'Changed_col'}).head()

Changed_col                        Name  Gender  Weight Transfer
Changed_now       Grade
Peking University Junior        Juan Xu  Female     NaN        N
                  Junior  Changjuan You  Female    47.0        N
                  Junior       Gaoli Xu  Female    48.0        N
                  Junior   Gaoquan Zhou    Male    70.0        N
                  Junior      Qiang You  Female    56.0        N

多层索引若没有索引名则不能改名，使用空值也不行，试了添加上才可以改变

In [59]:
idx_new = res.index.map(lambda x: (x[0], str.upper(x[1])))
res.index = idx_new
res.head()

all                                Name  Gender  Weight Transfer
School            Grade
Peking University JUNIOR        Juan Xu  Female     NaN        N
                  JUNIOR  Changjuan You  Female    47.0        N
                  JUNIOR       Gaoli Xu  Female    48.0        N
                  JUNIOR   Gaoquan Zhou    Male    70.0        N
                  JUNIOR      Qiang You  Female    56.0        N

In [60]:
idx_new = res.index.map(lambda x: (x[0]+'__'+x[1]))
res.index = idx_new
res.head()

all                                 Name  Gender  Weight Transfer
Peking University__JUNIOR        Juan Xu  Female     NaN        N
Peking University__JUNIOR  Changjuan You  Female    47.0        N
Peking University__JUNIOR       Gaoli Xu  Female    48.0        N
Peking University__JUNIOR   Gaoquan Zhou    Male    70.0        N
Peking University__JUNIOR      Qiang You  Female    56.0        N

In [61]:
idx_new = res.index.map(lambda x:tuple(x.split('__')))
res.index =idx_new
res.head()

all                                Name  Gender  Weight Transfer
Peking University JUNIOR        Juan Xu  Female     NaN        N
                  JUNIOR  Changjuan You  Female    47.0        N
                  JUNIOR       Gaoli Xu  Female    48.0        N
                  JUNIOR   Gaoquan Zhou    Male    70.0        N
                  JUNIOR      Qiang You  Female    56.0        N

map函数对索引的替换操作跟python中的字符串操作有些类似，应该还有很多功能可发掘

索引的设置和重置主要是以下两个：

索引的设置可以使用set_index完成，这里的主要参数是append，表示是否来保留原来的索引，直接把新设定的添加到原索引的内层：reset_index是set_index的逆函数，其主要参数是drop，表示是否要把去掉的索引层丢弃，而不是添加到列中

In [62]:
df_reindex = pd.DataFrame({"Weight":[60,70,80], "Height":[176,180,179]}, index=['1001','1003','1002'])
df_reindex

      Weight  Height
1001      60     176
1003      70     180
1002      80     179

In [67]:
df_reindex.reindex(index=['1001','1005','1003','1004'], columns=['Weight','Gender','Height'])

      Weight  Gender  Height
1001    60.0     NaN   176.0
1005     NaN     NaN     NaN
1003    70.0     NaN   180.0
1004     NaN     NaN     NaN

索引变形完全改变了数据结构，可用于在原表中提取某些数据创建一张新表

### 索引运算

$$\rm S_A.intersection(S_B) = \rm S_A \cap S_B \Leftrightarrow \rm \{x|x\in S_A\, and\, x\in S_B\}$$
$$\rm S_A.union(S_B) = \rm S_A \cup S_B \Leftrightarrow \rm \{x|x\in S_A\, or\, x\in S_B\}$$
$$\rm S_A.difference(S_B) = \rm S_A - S_B \Leftrightarrow \rm \{x|x\in S_A\, and\, x\notin S_B\}$$
$$\rm S_A.symmetric\_difference(S_B) = \rm S_A\triangle S_B\Leftrightarrow \rm \{x|x\in S_A\cup S_B - S_A\cap S_B\}$$

别让我看公式，一看就晕，感觉会有条件反射的，还是先看看一般的吧。

In [74]:
df_set_1 = pd.DataFrame([[0,1],[1,2],[3,4]], index = pd.Index(['a','b','a'],name='id1'))
df_set_2 = pd.DataFrame([[0,2],[1,3],[3,5]], index = pd.Index(['c','b','f'],name='id2'))
id1, id2 = df_set_1.index.unique(), df_set_2.index.unique()
id1.intersection(id2)

Index(['b'], dtype='object')

In [75]:
id1.union(id2)

Index(['a', 'b', 'c', 'f'], dtype='object')

In [76]:
id1.difference(id2)

Index(['a'], dtype='object')

In [77]:
id1.symmetric_difference(id2)

Index(['a', 'c', 'f'], dtype='object')

In [78]:
id1 & id2

Index(['b'], dtype='object')

In [79]:
id1 | id2

Index(['a', 'b', 'c', 'f'], dtype='object')

In [80]:
id1 ^ id2

Index(['a', 'c', 'f'], dtype='object')

In [81]:
df_set_in_col_1 = df_set_1.reset_index()
df_set_in_col_2 = df_set_2.reset_index()
df_set_in_col_1

  id1  0  1
0   a  0  1
1   b  1  2
2   a  3  4

In [82]:
df_set_in_col_2

  id2  0  1
0   c  0  2
1   b  1  3
2   f  3  5

In [93]:
df_set_in_col_1[(df_set_in_col_1.id1) != (df_set_in_col_2.id2)]

  id1  0  1
0   a  0  1
2   a  3  4

实际操作起来舒服多了，比公式好，基本上都能明白是什么，我的天，别搞那么高大上的公式好不？

#### 真的来不及
这一章的内容挺多，加上工作忙，匆匆忙忙把课程看完，练习没时间去做了，如果每章有五天的时间会相对好些，毕竟是抽时间学习，感觉每天都很赶，碰到不理解的，为了赶进度也就吞个大枣，不过落下的以后还是会补的，这课程对我来说真的很好，努力打完卡学完所有，消化不了的要靠重复学习了。